{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. ********************* 1. Data Import and Transformation:************************
. *                  - Importing and transforming data from the CSV file.
.    
. import delimited using "data/04-half-hourly.csv"
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(46 vars, 1,264,072 obs)

{com}. 
. //Transforming data: In the code below we are transforming the following string variables to long types or numerics respectively
. //Date
. gen date_new=date(date_local,"YMD")
{txt}
{com}. format date_new %td
{txt}
{com}. drop date_local
{txt}
{com}. rename date_new date
{res}{txt}
{com}. //DST Date
. gen dst_date_new = date(dst_date, "YMD")
{txt}
{com}. format dst_date_new %td
{txt}
{com}. drop dst_date
{txt}
{com}. rename dst_date_new dst_date
{res}{txt}
{com}. 
. * dst_now_here, Weekend
. *Converts dst_start
. gen dst_start_temp = 0
{txt}
{com}. replace dst_start_temp = 1 if dst_start == "TRUE"
{txt}(649,560 real changes made)

{com}. drop dst_start
{txt}
{com}. rename dst_start_temp dst_start
{res}{txt}
{com}. //after_transition 
. gen after_transition_temp = 0
{txt}
{com}. replace after_transition_temp = 1 if after_transition == "TRUE"
{txt}(629,272 real changes made)

{com}. drop after_transition
{txt}
{com}. rename after_transition_temp after_transition
{res}{txt}
{com}. //dst_now_anywhere
. gen dst_now_anywhere_temp = 0
{txt}
{com}. replace dst_now_anywhere_temp = 1 if dst_now_anywhere == "TRUE"
{txt}(626,280 real changes made)

{com}. drop dst_now_anywhere
{txt}
{com}. rename dst_now_anywhere_temp dst_now_anywhere
{res}{txt}
{com}. //dst_here_anytime
. gen dst_here_anytime_temp = 0
{txt}
{com}. replace dst_here_anytime_temp = 1 if dst_here_anytime == "TRUE"
{txt}(1,011,256 real changes made)

{com}. drop dst_here_anytime
{txt}
{com}. rename dst_here_anytime_temp dst_here_anytime
{res}{txt}
{com}. //Converts dst_now_here
. gen dst_now_here_temp = 0
{txt}
{com}. replace dst_now_here_temp = 1 if dst_now_here == "TRUE"
{txt}(501,000 real changes made)

{com}. drop dst_now_here
{txt}
{com}. rename dst_now_here_temp dst_now_here
{res}{txt}
{com}. //Converts Weekend
. gen Weekend_local_temp = 0
{txt}
{com}. replace Weekend_local_temp = 1 if weekend_local == "TRUE"
{txt}(360,952 real changes made)

{com}. drop weekend_local
{txt}
{com}. rename Weekend_local_temp weekend_local
{res}{txt}
{com}. //Converts public holiday
. gen public_holiday_temp = 0
{txt}
{com}. replace public_holiday_temp = 1 if public_holiday == "TRUE"
{txt}(42,732 real changes made)

{com}. drop public_holiday
{txt}
{com}. rename public_holiday_temp public_holiday
{res}{txt}
{com}. 
. //Converts dst_direction, start is 1
. gen dst_direction_temp = 0
{txt}
{com}. replace dst_direction_temp = 1 if dst_direction == "start"
{txt}(649,560 real changes made)

{com}. drop dst_direction
{txt}
{com}. rename dst_direction_temp dst_direction
{res}{txt}
{com}. //Encodes region id and dst transition
. encode regionid, gen(regionid1)
{txt}
{com}. encode dst_transition_id,gen(dst_transition1)
{txt}
{com}. //Scale by 1/10000 to increase coefficient size for interpretation
. rename wind_km_per_h wind
{res}{txt}
{com}. gen wind_3 = (wind*wind*wind)/10000
{txt}
{com}. //Generate not midday variable for DDD
. gen not_midday = 0
{txt}
{com}. replace not_midday = 1 if not_midday_control_local == "TRUE"
{txt}(1,106,062 real changes made)

{com}. 
. //Generating Labels
. // Labeling variables
. // Labeling variables
. label variable regionid "Region ID"
{txt}
{com}. label variable midday_control_fixed "Midday(Noon time) Control (Fixed Time)"
{txt}
{com}. label variable dst_now_anywhere "DST Now in Any Region (Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable dst_here_anytime "DST Region (Treatment)"
{txt}
{com}. label variable dst_transition_id "DST Transition ID, per year 2 IDs"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable energy_kwh_per_capita "kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable dst_now_here "DST Active Here (Treatment*Time)"
{txt}
{com}. label variable days_before_transition "Days Before DST Transition"
{txt}
{com}. label variable hr_local "Local Half-Hour Time"
{txt}
{com}. label variable energy_kwh_adj_rooftop_solar_per "Adjusted kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable days_after_transition "Days After DST Transition"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour Time"
{txt}
{com}. label variable total_renewables_today_twh "Total Renewables Today (TWh)"
{txt}
{com}. label variable total_renewables_today_twh_uigf "Total Renewables Today (TWh) - Uncertain Future"
{txt}
{com}. label variable co2_kg_per_capita_midday "Kg CO2 Emissions per Capita compared to the Midday period"
{txt}
{com}. label variable regionid1 "Region ID (Encoded)"
{txt}
{com}. label variable dst_transition1 "DST Transition (Encoded)"
{txt}
{com}. label variable dst_direction "Direction of DST for given transition"
{txt}
{com}. label variable wind "Mean Wind Speed (km/h) per day"
{txt}
{com}. label variable wind_3 "Daily mean Wind Speed (km/h) Cubed"
{txt}
{com}. label variable not_midday "Not Midday time period as a 0 or 1"
{txt}
{com}. label variable rooftop_solar_energy_mwh "Rooftop Solar Energy (MWh) per day"
{txt}
{com}. label variable hh_end_fixed "Fixed End Time"
{txt}
{com}. label variable hh_end_local "Local End Time"
{txt}
{com}. label variable hh_start_fixed "Fixed Start Time"
{txt}
{com}. label variable hh_start_local "Local Start Time"
{txt}
{com}. label variable date_fixed "Fixed Date"
{txt}
{com}. label variable midday_control_local "Midday Control (Local Time)"
{txt}
{com}. label variable midday_control_fixed "Midday Control (Fixed Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable hr_local "Local Half-Hour"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour"
{txt}
{com}. label variable day_of_week_local "Day of Week (Local Time)"
{txt}
{com}. label variable day_of_week_fixed "Day of Week (Fixed Time)"
{txt}
{com}. label variable weekend_local "Weekend (Local)"
{txt}
{com}. label variable weekend_fixed "Weekend (Fixed)"
{txt}
{com}. label variable public_holiday "1 if Public holiday in Region, 0 otherwise"
{txt}
{com}. label variable days_into_dst_extreme_outlier  "Days into DST for Extreme Outliers"
{txt}
{com}. label variable days_into_dst_outlier "Days into DST for Outliers"
{txt}
{com}. label variable population "Population in given State and Time period"
{txt}
{com}. label variable temperature "Mean Daily Temperature °C in given State"
{txt}
{com}. label variable solar_exposure "Solar Exposure Coefficient"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita "kwh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita_midday "Mean Electricity Consumption (kWh) per Capita during the Midday period"
{txt}
{com}. label variable co2_g_per_capita_vs_midday "CO2 Emissions (g) per Capita compared to the Midday period"
{txt}
{com}. label variable date "Date"
{txt}
{com}. label variable dst_date "DST Date"
{txt}
{com}. label variable dst_start "DST Start"
{txt}
{com}. label variable after_transition "After Transition"
{txt}
{com}. label variable dst_transition_id_and_region "DST Transition ID and Region"
{txt}
{com}. label variable energy_wh_per_capita_vs_midday "Electricity Consumption (Wh) per Capita compared to the Midday period"
{txt}
{com}. label variable days_into_dst "Number of Days into the DST transition"
{txt}
{com}. 
. save "data/05-half-hourly.dta", replace
{txt}{p 0 4 2}
(file {bf}
data/05-half-hourly.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
data/05-half-hourly.dta{rm}
saved
{p_end}

{com}. 
. ///////////////////////// Regressions /////////////////////////////////////////
> /*******************2. Base DiD Regressions:*************************************
> - Event studies for CO2 emissions and electricity consumption using `eventdd`.
> - Plots are generated and exported.
> - Results are stored in `results/EventStudy-Co2.png` and `results/EventStudy-Elec.png`.*/
. use "data/05-half-hourly.dta", clear
{txt}
{com}. 
. //Base 
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(2, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1525
                                                {txt}Root MSE          =    {res} .14878

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1332327{col 27}{space 2}  .039085{col 38}{space 1}   -3.41{col 47}{space 3}0.027{col 55}{space 4}  -.24175{col 68}{space 3}-.0247153
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0242945{col 27}{space 2} 1.50e-14{col 38}{space 1} 1.6e+12{col 47}{space 3}0.000{col 55}{space 4} .0242945{col 68}{space 3} .0242945
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0329705{col 27}{space 2} .0066293{col 38}{space 1}   -4.97{col 47}{space 3}0.008{col 55}{space 4}-.0513763{col 68}{space 3}-.0145647
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .5759782{col 27}{space 2} 1.41e-14{col 38}{space 1} 4.1e+13{col 47}{space 3}0.000{col 55}{space 4} .5759782{col 68}{space 3} .5759782
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_Base
{txt}
{com}. //Controls
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere weekend_local public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.2132
                                                {txt}Root MSE          =    {res} .14335

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1439874{col 27}{space 2} .0280714{col 38}{space 1}   -5.13{col 47}{space 3}0.007{col 55}{space 4}-.2219261{col 68}{space 3}-.0660486
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0262619{col 27}{space 2} .0173514{col 38}{space 1}    1.51{col 47}{space 3}0.205{col 55}{space 4}-.0219132{col 68}{space 3} .0744371
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0181134{col 27}{space 2} .0222476{col 38}{space 1}   -0.81{col 47}{space 3}0.461{col 55}{space 4}-.0798827{col 68}{space 3} .0436559
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2} -.033831{col 27}{space 2} .0013227{col 38}{space 1}  -25.58{col 47}{space 3}0.000{col 55}{space 4}-.0375035{col 68}{space 3}-.0301586
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0377945{col 27}{space 2} .0055602{col 38}{space 1}   -6.80{col 47}{space 3}0.002{col 55}{space 4}-.0532319{col 68}{space 3} -.022357
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0108863{col 27}{space 2} .0141706{col 38}{space 1}   -0.77{col 47}{space 3}0.485{col 55}{space 4}-.0502303{col 68}{space 3} .0284577
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0002718{col 27}{space 2} .0002346{col 38}{space 1}    1.16{col 47}{space 3}0.311{col 55}{space 4}-.0003796{col 68}{space 3} .0009232
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0042183{col 27}{space 2}   .00631{col 38}{space 1}   -0.67{col 47}{space 3}0.540{col 55}{space 4}-.0217375{col 68}{space 3}  .013301
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.0593653{col 27}{space 2} .0249105{col 38}{space 1}   -2.38{col 47}{space 3}0.076{col 55}{space 4}-.1285278{col 68}{space 3} .0097972
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .7364206{col 27}{space 2} .2152255{col 38}{space 1}    3.42{col 47}{space 3}0.027{col 55}{space 4} .1388589{col 68}{space 3} 1.333982
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_DiD
{txt}
{com}. 
. /// Elec_DiD
> //Base
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(2, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3262
                                                {txt}Root MSE          =    {res} .12666

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1795521{col 27}{space 2} .0284118{col 38}{space 1}   -6.32{col 47}{space 3}0.003{col 55}{space 4}-.2584358{col 68}{space 3}-.1006684
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0316603{col 27}{space 2} 6.03e-15{col 38}{space 1} 5.2e+12{col 47}{space 3}0.000{col 55}{space 4} .0316603{col 68}{space 3} .0316603
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0567784{col 27}{space 2} .0091992{col 38}{space 1}   -6.17{col 47}{space 3}0.003{col 55}{space 4}-.0823196{col 68}{space 3}-.0312372
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .6559489{col 27}{space 2} 6.97e-15{col 38}{space 1} 9.4e+13{col 47}{space 3}0.000{col 55}{space 4} .6559489{col 68}{space 3} .6559489
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_Base
{txt}
{com}. 
. // Controls
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere weekend_local public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3781
                                                {txt}Root MSE          =    {res} .12168

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.2149418{col 27}{space 2} .0197522{col 38}{space 1}  -10.88{col 47}{space 3}0.000{col 55}{space 4}-.2697827{col 68}{space 3}-.1601009
{txt}dst_now_any~e {c |}{col 15}{res}{space 2}  .031467{col 27}{space 2} .0173533{col 38}{space 1}    1.81{col 47}{space 3}0.144{col 55}{space 4}-.0167136{col 68}{space 3} .0796476
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0235068{col 27}{space 2} .0160757{col 38}{space 1}   -1.46{col 47}{space 3}0.217{col 55}{space 4}  -.06814{col 68}{space 3} .0211264
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2}-.0461566{col 27}{space 2} .0018091{col 38}{space 1}  -25.51{col 47}{space 3}0.000{col 55}{space 4}-.0511796{col 68}{space 3}-.0411336
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0498073{col 27}{space 2} .0038723{col 38}{space 1}  -12.86{col 47}{space 3}0.000{col 55}{space 4}-.0605586{col 68}{space 3} -.039056
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0250168{col 27}{space 2}  .016778{col 38}{space 1}   -1.49{col 47}{space 3}0.210{col 55}{space 4}   -.0716{col 68}{space 3} .0215664
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0005213{col 27}{space 2} .0002887{col 38}{space 1}    1.81{col 47}{space 3}0.145{col 55}{space 4}-.0002803{col 68}{space 3} .0013228
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0081455{col 27}{space 2} .0059962{col 38}{space 1}   -1.36{col 47}{space 3}0.246{col 55}{space 4}-.0247938{col 68}{space 3} .0085027
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2} .0041665{col 27}{space 2} .0118573{col 38}{space 1}    0.35{col 47}{space 3}0.743{col 55}{space 4}-.0287546{col 68}{space 3} .0370876
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 1.007665{col 27}{space 2} .2649951{col 38}{space 1}    3.80{col 47}{space 3}0.019{col 55}{space 4}  .271921{col 68}{space 3}  1.74341
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_DiD
{txt}
{com}. 
. esttab CO2_Base Elec_Base CO2_DiD Elec_DiD using "results/DiD-results.tex", label se stats(r2 r2_a) replace
{res}{txt}(output written to {browse  `"results/DiD-results.tex"'})

{com}. 
. /*****************************3. Event Studies:*********************************
> - Event studies for CO2 emissions and electricity consumption using `eventdd`.
> - Plots are generated and exported.
> - Results are stored in `results/EventStudy-Co2.png` and `results/EventStudy-Elec.png`.
> */
. 
. use "data/05-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. 
. eventdd co2_kg_per_capita public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Co2 kg per capita") xtitle("Days until DST transition") title("Event Study - CO2 Emissions"))
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. do "/home/matthew/applied_repo/05-event-study.do"
{txt}
{com}. ********************************************************************************
. * M1 APPLIED ECONOMETRICS, Spring 2024 
. *
. * Applied Econometrics - Master TSE 1 - 2023/2024
. * "Exploring the Influence of Daylight Saving Time on CO2 Emissions 
. * and Electricity Consumption in Australia's Electricity Grid"
. *
. * Summary statistics, Difference-in-Differences, DDD, Event studies
. *
. * LAST MODIFIED: 29/02/2024 *
. * LAST MODIFIED BY: Alexander Köhler*
. * software version: Stata 17.0 SE-Standard Edition
. * processors: Intel(R) Core(TM) i7-7500U CPU @ 2.7 GHz
. * OS: Windows 10 Pro, 22H2, 19045.4046
. * machine type: Laptop
. ********************************************************************************
. *Required Packages:
. //ssc install estout
. //ssc install eventdd
. //ssc install reghdfe
. //ssc install matsort
. 
. /*Structure:
> Summary of the sections:
> 
> 1. **Data Import and Transformation:**
>    - Importing and transforming data from the CSV file.
> 
> 2. **Base DiD Regressions:**
>    - Two sets of DiD regressions for CO2 emissions and electricity consumption.
>    - Base regressions without controls.
>    - DiD regressions with additional controls (weekend_local, public_holiday, temperature, etc.).
>    - Results are stored in `eststo CO2_Base` and `eststo Elec_Base`.
> 
> 3. **Event Studies:**
>    - Event studies for CO2 emissions and electricity consumption using `eventdd`.
>    - Plots are generated and exported.
>    - Results are stored in `results/EventStudy-Co2.png` and `results/EventStudy-Elec.png`.
> 
> 4. **DDD Design and Event Study:**
>    - DiD regressions with additional interaction terms for DDD design.
>    - Event studies for CO2 emissions and electricity consumption in DDD design.
>    - Results are stored in `eststo CO2_DDD` and `eststo Elec_DDD`.
>    - Event studies are exported to files.
> 
> 5. **Event Study by Transition Direction:**
>    - Event studies for CO2 emissions in DDD design, separated by DST start and stop directions.
>    - Results are exported to files.
> 
> 6. **Additional Robustness Checks:**
>    - Event studies for CO2 emissions and electricity consumption after dropping data related to Tasmania.
>    - Results are exported to files.
> 
> 7. **Event Study with ln(CO2) for Interpretation:**
>    - Event study for ln(CO2) after dropping data related to Tasmania.
>    - Result is exported to a file.
> 
> 8. **Tables with lnCO2 and ln Electricity Consumption:**
>    - DiD regressions for ln(CO2) and ln(electricity consumption) with additional controls.
>    - Results are stored in `eststo ln_CO2_DDD` and `eststo ln_Elec_DDD`.
>    - Tables are generated and exported.
> 
> 9. **DDD without Controls:**
>    - DiD regressions for CO2 emissions and electricity consumption without additional controls.
>    - Results are stored in `eststo CO2_DDD_base` and `eststo Elec_DDD_base`.
> */
. 
. *******************************************************************************
. 
. clear all
{res}{txt}
{com}. //cd "C:\Users\Alex\Documents\GitHub\applied-econometrics-dst"
. cd "/home/matthew/applied_repo"
{res}/home/matthew/applied_repo
{txt}
{com}. set linesize 80
{txt}
{com}. 
. *CREATE LOG FILE 
. cap log using "logs/05-Tables-and-Graphs-from-Stata", replace
{txt}
{com}. 
. ********************* 1. Data Import and Transformation:************************
. *                  - Importing and transforming data from the CSV file.
.    
. import delimited using "data/04-half-hourly.csv"
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(46 vars, 1,264,072 obs)

{com}. 
. //Transforming data: In the code below we are transforming the following string variables to long types or numerics respectively
. //Date
. gen date_new=date(date_local,"YMD")
{txt}
{com}. format date_new %td
{txt}
{com}. drop date_local
{txt}
{com}. rename date_new date
{res}{txt}
{com}. //DST Date
. gen dst_date_new = date(dst_date, "YMD")
{txt}
{com}. format dst_date_new %td
{txt}
{com}. drop dst_date
{txt}
{com}. rename dst_date_new dst_date
{res}{txt}
{com}. 
. * dst_now_here, Weekend
. *Converts dst_start
. gen dst_start_temp = 0
{txt}
{com}. replace dst_start_temp = 1 if dst_start == "TRUE"
{txt}(649,560 real changes made)

{com}. drop dst_start
{txt}
{com}. rename dst_start_temp dst_start
{res}{txt}
{com}. //after_transition 
. gen after_transition_temp = 0
{txt}
{com}. replace after_transition_temp = 1 if after_transition == "TRUE"
{txt}(629,272 real changes made)

{com}. drop after_transition
{txt}
{com}. rename after_transition_temp after_transition
{res}{txt}
{com}. //dst_now_anywhere
. gen dst_now_anywhere_temp = 0
{txt}
{com}. replace dst_now_anywhere_temp = 1 if dst_now_anywhere == "TRUE"
{txt}(626,280 real changes made)

{com}. drop dst_now_anywhere
{txt}
{com}. rename dst_now_anywhere_temp dst_now_anywhere
{res}{txt}
{com}. //dst_here_anytime
. gen dst_here_anytime_temp = 0
{txt}
{com}. replace dst_here_anytime_temp = 1 if dst_here_anytime == "TRUE"
{txt}(1,011,256 real changes made)

{com}. drop dst_here_anytime
{txt}
{com}. rename dst_here_anytime_temp dst_here_anytime
{res}{txt}
{com}. //Converts dst_now_here
. gen dst_now_here_temp = 0
{txt}
{com}. replace dst_now_here_temp = 1 if dst_now_here == "TRUE"
{txt}(501,000 real changes made)

{com}. drop dst_now_here
{txt}
{com}. rename dst_now_here_temp dst_now_here
{res}{txt}
{com}. //Converts Weekend
. gen Weekend_local_temp = 0
{txt}
{com}. replace Weekend_local_temp = 1 if weekend_local == "TRUE"
{txt}(360,952 real changes made)

{com}. drop weekend_local
{txt}
{com}. rename Weekend_local_temp weekend_local
{res}{txt}
{com}. //Converts public holiday
. gen public_holiday_temp = 0
{txt}
{com}. replace public_holiday_temp = 1 if public_holiday == "TRUE"
{txt}(42,732 real changes made)

{com}. drop public_holiday
{txt}
{com}. rename public_holiday_temp public_holiday
{res}{txt}
{com}. 
. //Converts dst_direction, start is 1
. gen dst_direction_temp = 0
{txt}
{com}. replace dst_direction_temp = 1 if dst_direction == "start"
{txt}(649,560 real changes made)

{com}. drop dst_direction
{txt}
{com}. rename dst_direction_temp dst_direction
{res}{txt}
{com}. //Encodes region id and dst transition
. encode regionid, gen(regionid1)
{txt}
{com}. encode dst_transition_id,gen(dst_transition1)
{txt}
{com}. //Scale by 1/10000 to increase coefficient size for interpretation
. rename wind_km_per_h wind
{res}{txt}
{com}. gen wind_3 = (wind*wind*wind)/10000
{txt}
{com}. //Generate not midday variable for DDD
. gen not_midday = 0
{txt}
{com}. replace not_midday = 1 if not_midday_control_local == "TRUE"
{txt}(1,106,062 real changes made)

{com}. 
. //Generating Labels
. // Labeling variables
. // Labeling variables
. label variable regionid "Region ID"
{txt}
{com}. label variable midday_control_fixed "Midday(Noon time) Control (Fixed Time)"
{txt}
{com}. label variable dst_now_anywhere "DST Now in Any Region (Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable dst_here_anytime "DST Region (Treatment)"
{txt}
{com}. label variable dst_transition_id "DST Transition ID, per year 2 IDs"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable energy_kwh_per_capita "kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable dst_now_here "DST Active Here (Treatment*Time)"
{txt}
{com}. label variable days_before_transition "Days Before DST Transition"
{txt}
{com}. label variable hr_local "Local Half-Hour Time"
{txt}
{com}. label variable energy_kwh_adj_rooftop_solar_per "Adjusted kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable days_after_transition "Days After DST Transition"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour Time"
{txt}
{com}. label variable total_renewables_today_twh "Total Renewables Today (TWh)"
{txt}
{com}. label variable total_renewables_today_twh_uigf "Total Renewables Today (TWh) - Uncertain Future"
{txt}
{com}. label variable co2_kg_per_capita_midday "Kg CO2 Emissions per Capita compared to the Midday period"
{txt}
{com}. label variable regionid1 "Region ID (Encoded)"
{txt}
{com}. label variable dst_transition1 "DST Transition (Encoded)"
{txt}
{com}. label variable dst_direction "Direction of DST for given transition"
{txt}
{com}. label variable wind "Mean Wind Speed (km/h) per day"
{txt}
{com}. label variable wind_3 "Daily mean Wind Speed (km/h) Cubed"
{txt}
{com}. label variable not_midday "Not Midday time period as a 0 or 1"
{txt}
{com}. label variable rooftop_solar_energy_mwh "Rooftop Solar Energy (MWh) per day"
{txt}
{com}. label variable hh_end_fixed "Fixed End Time"
{txt}
{com}. label variable hh_end_local "Local End Time"
{txt}
{com}. label variable hh_start_fixed "Fixed Start Time"
{txt}
{com}. label variable hh_start_local "Local Start Time"
{txt}
{com}. label variable date_fixed "Fixed Date"
{txt}
{com}. label variable midday_control_local "Midday Control (Local Time)"
{txt}
{com}. label variable midday_control_fixed "Midday Control (Fixed Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable hr_local "Local Half-Hour"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour"
{txt}
{com}. label variable day_of_week_local "Day of Week (Local Time)"
{txt}
{com}. label variable day_of_week_fixed "Day of Week (Fixed Time)"
{txt}
{com}. label variable weekend_local "Weekend (Local)"
{txt}
{com}. label variable weekend_fixed "Weekend (Fixed)"
{txt}
{com}. label variable public_holiday "1 if Public holiday in Region, 0 otherwise"
{txt}
{com}. label variable days_into_dst_extreme_outlier  "Days into DST for Extreme Outliers"
{txt}
{com}. label variable days_into_dst_outlier "Days into DST for Outliers"
{txt}
{com}. label variable population "Population in given State and Time period"
{txt}
{com}. label variable temperature "Mean Daily Temperature °C in given State"
{txt}
{com}. label variable solar_exposure "Solar Exposure Coefficient"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita "kwh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita_midday "Mean Electricity Consumption (kWh) per Capita during the Midday period"
{txt}
{com}. label variable co2_g_per_capita_vs_midday "CO2 Emissions (g) per Capita compared to the Midday period"
{txt}
{com}. label variable date "Date"
{txt}
{com}. label variable dst_date "DST Date"
{txt}
{com}. label variable dst_start "DST Start"
{txt}
{com}. label variable after_transition "After Transition"
{txt}
{com}. label variable dst_transition_id_and_region "DST Transition ID and Region"
{txt}
{com}. label variable energy_wh_per_capita_vs_midday "Electricity Consumption (Wh) per Capita compared to the Midday period"
{txt}
{com}. label variable days_into_dst "Number of Days into the DST transition"
{txt}
{com}. 
. save "data/05-half-hourly.dta", replace
{txt}{p 0 4 2}
file {bf}
data/05-half-hourly.dta{rm}
saved
{p_end}

{com}. 
. ///////////////////////// Regressions /////////////////////////////////////////
> /*******************2. Base DiD Regressions:*************************************
> - Event studies for CO2 emissions and electricity consumption using `eventdd`.
> - Plots are generated and exported.
> - Results are stored in `results/EventStudy-Co2.png` and `results/EventStudy-Elec.png`.*/
. use "data/05-half-hourly.dta", clear
{txt}
{com}. 
. //Base 
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(2, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.1525
                                                {txt}Root MSE          =    {res} .14878

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1332327{col 27}{space 2}  .039085{col 38}{space 1}   -3.41{col 47}{space 3}0.027{col 55}{space 4}  -.24175{col 68}{space 3}-.0247153
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0242945{col 27}{space 2} 1.51e-14{col 38}{space 1} 1.6e+12{col 47}{space 3}0.000{col 55}{space 4} .0242945{col 68}{space 3} .0242945
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0329705{col 27}{space 2} .0066293{col 38}{space 1}   -4.97{col 47}{space 3}0.008{col 55}{space 4}-.0513763{col 68}{space 3}-.0145647
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .5759782{col 27}{space 2} 1.41e-14{col 38}{space 1} 4.1e+13{col 47}{space 3}0.000{col 55}{space 4} .5759782{col 68}{space 3} .5759782
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_Base
{txt}
{com}. //Controls
. reg co2_kg_per_capita c.dst_here_anytime##c.dst_now_anywhere weekend_local public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.2132
                                                {txt}Root MSE          =    {res} .14335

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}co2_kg_per_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1439874{col 27}{space 2} .0280714{col 38}{space 1}   -5.13{col 47}{space 3}0.007{col 55}{space 4}-.2219261{col 68}{space 3}-.0660486
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0262619{col 27}{space 2} .0173514{col 38}{space 1}    1.51{col 47}{space 3}0.205{col 55}{space 4}-.0219132{col 68}{space 3} .0744371
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0181134{col 27}{space 2} .0222476{col 38}{space 1}   -0.81{col 47}{space 3}0.461{col 55}{space 4}-.0798827{col 68}{space 3} .0436559
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2} -.033831{col 27}{space 2} .0013227{col 38}{space 1}  -25.58{col 47}{space 3}0.000{col 55}{space 4}-.0375035{col 68}{space 3}-.0301586
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0377945{col 27}{space 2} .0055602{col 38}{space 1}   -6.80{col 47}{space 3}0.002{col 55}{space 4}-.0532319{col 68}{space 3} -.022357
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0108863{col 27}{space 2} .0141706{col 38}{space 1}   -0.77{col 47}{space 3}0.485{col 55}{space 4}-.0502303{col 68}{space 3} .0284577
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0002718{col 27}{space 2} .0002346{col 38}{space 1}    1.16{col 47}{space 3}0.311{col 55}{space 4}-.0003796{col 68}{space 3} .0009232
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0042183{col 27}{space 2}   .00631{col 38}{space 1}   -0.67{col 47}{space 3}0.540{col 55}{space 4}-.0217375{col 68}{space 3}  .013301
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2}-.0593653{col 27}{space 2} .0249105{col 38}{space 1}   -2.38{col 47}{space 3}0.076{col 55}{space 4}-.1285278{col 68}{space 3} .0097972
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} .7364206{col 27}{space 2} .2152255{col 38}{space 1}    3.42{col 47}{space 3}0.027{col 55}{space 4} .1388589{col 68}{space 3} 1.333982
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo CO2_DiD
{txt}
{com}. 
. /// Elec_DiD
> //Base
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(2, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3262
                                                {txt}Root MSE          =    {res} .12666

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.1795521{col 27}{space 2} .0284118{col 38}{space 1}   -6.32{col 47}{space 3}0.003{col 55}{space 4}-.2584358{col 68}{space 3}-.1006684
{txt}dst_now_any~e {c |}{col 15}{res}{space 2} .0316603{col 27}{space 2} 6.03e-15{col 38}{space 1} 5.2e+12{col 47}{space 3}0.000{col 55}{space 4} .0316603{col 68}{space 3} .0316603
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0567784{col 27}{space 2} .0091992{col 38}{space 1}   -6.17{col 47}{space 3}0.003{col 55}{space 4}-.0823196{col 68}{space 3}-.0312372
{txt}{space 13} {c |}
{space 8}_cons {c |}{col 15}{res}{space 2} .6559489{col 27}{space 2} 6.98e-15{col 38}{space 1} 9.4e+13{col 47}{space 3}0.000{col 55}{space 4} .6559489{col 68}{space 3} .6559489
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_Base
{txt}
{com}. 
. // Controls
. reg energy_kwh_per_capita c.dst_here_anytime##c.dst_now_anywhere weekend_local public_holiday c.temperature##c.temperature solar_exposure wind_3 [aweight = population], vce(cluster regionid1)
{txt}(sum of wgt is 5405493683000.063)

Linear regression                               Number of obs     = {res} 1,264,072
                                                {txt}{help j_robustsingular:F(3, 4) }          =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.3781
                                                {txt}Root MSE          =    {res} .12168

{txt}{ralign 79:(Std. err. adjusted for {res:5} clusters in {res:regionid1})}
{hline 14}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 15}{c |}{col 27}    Robust
{col 1}energy_kwh_~a{col 15}{c |} Coefficient{col 27}  std. err.{col 39}      t{col 47}   P>|t|{col 55}     [95% con{col 68}f. interval]
{hline 14}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
dst_here_an~e {c |}{col 15}{res}{space 2}-.2149418{col 27}{space 2} .0197522{col 38}{space 1}  -10.88{col 47}{space 3}0.000{col 55}{space 4}-.2697827{col 68}{space 3}-.1601009
{txt}dst_now_any~e {c |}{col 15}{res}{space 2}  .031467{col 27}{space 2} .0173533{col 38}{space 1}    1.81{col 47}{space 3}0.144{col 55}{space 4}-.0167136{col 68}{space 3} .0796476
{txt}{space 13} {c |}
{space 11}c. {c |}
dst_here_an~e#{c |}
{space 11}c. {c |}
dst_now_any~e {c |}{col 15}{res}{space 2}-.0235068{col 27}{space 2} .0160757{col 38}{space 1}   -1.46{col 47}{space 3}0.217{col 55}{space 4}  -.06814{col 68}{space 3} .0211264
{txt}{space 13} {c |}
weekend_local {c |}{col 15}{res}{space 2}-.0461566{col 27}{space 2} .0018091{col 38}{space 1}  -25.51{col 47}{space 3}0.000{col 55}{space 4}-.0511796{col 68}{space 3}-.0411336
{txt}public_holi~y {c |}{col 15}{res}{space 2}-.0498073{col 27}{space 2} .0038723{col 38}{space 1}  -12.86{col 47}{space 3}0.000{col 55}{space 4}-.0605586{col 68}{space 3} -.039056
{txt}{space 2}temperature {c |}{col 15}{res}{space 2}-.0250168{col 27}{space 2}  .016778{col 38}{space 1}   -1.49{col 47}{space 3}0.210{col 55}{space 4}   -.0716{col 68}{space 3} .0215664
{txt}{space 13} {c |}
{space 11}c. {c |}
{space 2}temperature#{c |}
c.temperature {c |}{col 15}{res}{space 2} .0005213{col 27}{space 2} .0002887{col 38}{space 1}    1.81{col 47}{space 3}0.145{col 55}{space 4}-.0002803{col 68}{space 3} .0013228
{txt}{space 13} {c |}
solar_expos~e {c |}{col 15}{res}{space 2}-.0081455{col 27}{space 2} .0059962{col 38}{space 1}   -1.36{col 47}{space 3}0.246{col 55}{space 4}-.0247938{col 68}{space 3} .0085027
{txt}{space 7}wind_3 {c |}{col 15}{res}{space 2} .0041665{col 27}{space 2} .0118573{col 38}{space 1}    0.35{col 47}{space 3}0.743{col 55}{space 4}-.0287546{col 68}{space 3} .0370876
{txt}{space 8}_cons {c |}{col 15}{res}{space 2} 1.007665{col 27}{space 2} .2649951{col 38}{space 1}    3.80{col 47}{space 3}0.019{col 55}{space 4}  .271921{col 68}{space 3}  1.74341
{txt}{hline 14}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. eststo Elec_DiD
{txt}
{com}. 
. esttab CO2_Base Elec_Base CO2_DiD Elec_DiD using "results/DiD-results.tex", label se stats(r2 r2_a) replace
{res}{txt}(output written to {browse  `"results/DiD-results.tex"'})

{com}. 
. /*****************************3. Event Studies:*********************************
> - Event studies for CO2 emissions and electricity consumption using `eventdd`.
> - Plots are generated and exported.
> - Results are stored in `results/EventStudy-Co2.png` and `results/EventStudy-Elec.png`.
> */
. 
. use "data/05-half-hourly.dta", clear
{txt}
{com}. gen timevar = .
{txt}(1,264,072 missing values generated)

{com}. replace timevar = days_into_dst if dst_here_anytime == 1
{txt}(1,011,256 real changes made)

{com}. 
. eventdd co2_kg_per_capita public_holiday c.temperature##c.temperature solar_exposure wind_3  [aweight = population], timevar(timevar) method(hdfe, absorb(regionid1 date) cluster(regionid1)) graph_op(ytitle("Co2 kg per capita") xtitle("Days until DST transition") title("Event Study - CO2 Emissions"))
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. do "/tmp/SD60060.000000"
{txt}
{com}. ********************************************************************************
. * M1 APPLIED ECONOMETRICS, Spring 2024 
. *
. * Applied Econometrics - Master TSE 1 - 2023/2024
. * "Exploring the Influence of Daylight Saving Time on CO2 Emissions 
. * and Electricity Consumption in Australia's Electricity Grid"
. *
. * Summary statistics, Difference-in-Differences, DDD, Event studies
. *
. * LAST MODIFIED: 29/02/2024 *
. * LAST MODIFIED BY: Alexander Köhler*
. * software version: Stata 17.0 SE-Standard Edition
. * processors: Intel(R) Core(TM) i7-7500U CPU @ 2.7 GHz
. * OS: Windows 10 Pro, 22H2, 19045.4046
. * machine type: Laptop
. ********************************************************************************
. *Required Packages:
. //ssc install estout
. //ssc install eventdd
. //ssc install reghdfe
. //ssc install matsort
. 
. /*Structure:
> Summary of the sections:
> 
> 1. **Data Import and Transformation:**
>    - Importing and transforming data from the CSV file.
> 
> 2. **Base DiD Regressions:**
>    - Two sets of DiD regressions for CO2 emissions and electricity consumption.
>    - Base regressions without controls.
>    - DiD regressions with additional controls (weekend_local, public_holiday, temperature, etc.).
>    - Results are stored in `eststo CO2_Base` and `eststo Elec_Base`.
> 
> 3. **Event Studies:**
>    - Event studies for CO2 emissions and electricity consumption using `eventdd`.
>    - Plots are generated and exported.
>    - Results are stored in `results/EventStudy-Co2.png` and `results/EventStudy-Elec.png`.
> 
> 4. **DDD Design and Event Study:**
>    - DiD regressions with additional interaction terms for DDD design.
>    - Event studies for CO2 emissions and electricity consumption in DDD design.
>    - Results are stored in `eststo CO2_DDD` and `eststo Elec_DDD`.
>    - Event studies are exported to files.
> 
> 5. **Event Study by Transition Direction:**
>    - Event studies for CO2 emissions in DDD design, separated by DST start and stop directions.
>    - Results are exported to files.
> 
> 6. **Additional Robustness Checks:**
>    - Event studies for CO2 emissions and electricity consumption after dropping data related to Tasmania.
>    - Results are exported to files.
> 
> 7. **Event Study with ln(CO2) for Interpretation:**
>    - Event study for ln(CO2) after dropping data related to Tasmania.
>    - Result is exported to a file.
> 
> 8. **Tables with lnCO2 and ln Electricity Consumption:**
>    - DiD regressions for ln(CO2) and ln(electricity consumption) with additional controls.
>    - Results are stored in `eststo ln_CO2_DDD` and `eststo ln_Elec_DDD`.
>    - Tables are generated and exported.
> 
> 9. **DDD without Controls:**
>    - DiD regressions for CO2 emissions and electricity consumption without additional controls.
>    - Results are stored in `eststo CO2_DDD_base` and `eststo Elec_DDD_base`.
> */
. 
. *******************************************************************************
. 
. clear all
{res}{txt}
{com}. //cd "C:\Users\Alex\Documents\GitHub\applied-econometrics-dst"
. cd "/home/matthew/applied_repo"
{res}/home/matthew/applied_repo
{txt}
{com}. set linesize 80
{txt}
{com}. 
. *CREATE LOG FILE 
. cap log using "logs/05-Tables-and-Graphs-from-Stata", replace
{txt}
{com}. 
. ********************* 1. Data Import and Transformation:************************
. *                  - Importing and transforming data from the CSV file.
.    
. import delimited using "data/04-half-hourly.csv"
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(46 vars, 1,264,072 obs)

{com}. 
. //Transforming data: In the code below we are transforming the following string variables to long types or numerics respectively
. //Date
. gen date_new=date(date_local,"YMD")
{txt}
{com}. format date_new %td
{txt}
{com}. drop date_local
{txt}
{com}. rename date_new date
{res}{txt}
{com}. //DST Date
. gen dst_date_new = date(dst_date, "YMD")
{txt}
{com}. format dst_date_new %td
{txt}
{com}. drop dst_date
{txt}
{com}. rename dst_date_new dst_date
{res}{txt}
{com}. 
. * dst_now_here, Weekend
. *Converts dst_start
. gen dst_start_temp = 0
{txt}
{com}. replace dst_start_temp = 1 if dst_start == "TRUE"
{txt}(649,560 real changes made)

{com}. drop dst_start
{txt}
{com}. rename dst_start_temp dst_start
{res}{txt}
{com}. //after_transition 
. gen after_transition_temp = 0
{txt}
{com}. replace after_transition_temp = 1 if after_transition == "TRUE"
{txt}(629,272 real changes made)

{com}. drop after_transition
{txt}
{com}. rename after_transition_temp after_transition
{res}{txt}
{com}. //dst_now_anywhere
. gen dst_now_anywhere_temp = 0
{txt}
{com}. replace dst_now_anywhere_temp = 1 if dst_now_anywhere == "TRUE"
{txt}(626,280 real changes made)

{com}. drop dst_now_anywhere
{txt}
{com}. rename dst_now_anywhere_temp dst_now_anywhere
{res}{txt}
{com}. //dst_here_anytime
. gen dst_here_anytime_temp = 0
{txt}
{com}. replace dst_here_anytime_temp = 1 if dst_here_anytime == "TRUE"
{txt}(1,011,256 real changes made)

{com}. drop dst_here_anytime
{txt}
{com}. rename dst_here_anytime_temp dst_here_anytime
{res}{txt}
{com}. //Converts dst_now_here
. gen dst_now_here_temp = 0
{txt}
{com}. replace dst_now_here_temp = 1 if dst_now_here == "TRUE"
{txt}(501,000 real changes made)

{com}. drop dst_now_here
{txt}
{com}. rename dst_now_here_temp dst_now_here
{res}{txt}
{com}. //Converts Weekend
. gen Weekend_local_temp = 0
{txt}
{com}. replace Weekend_local_temp = 1 if weekend_local == "TRUE"
{txt}(360,952 real changes made)

{com}. drop weekend_local
{txt}
{com}. rename Weekend_local_temp weekend_local
{res}{txt}
{com}. //Converts public holiday
. gen public_holiday_temp = 0
{txt}
{com}. replace public_holiday_temp = 1 if public_holiday == "TRUE"
{txt}(42,732 real changes made)

{com}. drop public_holiday
{txt}
{com}. rename public_holiday_temp public_holiday
{res}{txt}
{com}. 
. //Converts dst_direction, start is 1
. gen dst_direction_temp = 0
{txt}
{com}. replace dst_direction_temp = 1 if dst_direction == "start"
{txt}(649,560 real changes made)

{com}. drop dst_direction
{txt}
{com}. rename dst_direction_temp dst_direction
{res}{txt}
{com}. //Encodes region id and dst transition
. encode regionid, gen(regionid1)
{txt}
{com}. encode dst_transition_id,gen(dst_transition1)
{txt}
{com}. //Scale by 1/10000 to increase coefficient size for interpretation
. rename wind_km_per_h wind
{res}{txt}
{com}. gen wind_3 = (wind*wind*wind)/10000
{txt}
{com}. //Generate not midday variable for DDD
. gen not_midday = 0
{txt}
{com}. replace not_midday = 1 if not_midday_control_local == "TRUE"
{txt}(1,106,062 real changes made)

{com}. 
. //Generating Labels
. // Labeling variables
. // Labeling variables
. label variable regionid "Region ID"
{txt}
{com}. label variable midday_control_fixed "Midday(Noon time) Control (Fixed Time)"
{txt}
{com}. label variable dst_now_anywhere "DST Now in Any Region (Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable dst_here_anytime "DST Region (Treatment)"
{txt}
{com}. label variable dst_transition_id "DST Transition ID, per year 2 IDs"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable energy_kwh_per_capita "kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable dst_now_here "DST Active Here (Treatment*Time)"
{txt}
{com}. label variable days_before_transition "Days Before DST Transition"
{txt}
{com}. label variable hr_local "Local Half-Hour Time"
{txt}
{com}. label variable energy_kwh_adj_rooftop_solar_per "Adjusted kWh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable days_after_transition "Days After DST Transition"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour Time"
{txt}
{com}. label variable total_renewables_today_twh "Total Renewables Today (TWh)"
{txt}
{com}. label variable total_renewables_today_twh_uigf "Total Renewables Today (TWh) - Uncertain Future"
{txt}
{com}. label variable co2_kg_per_capita_midday "Kg CO2 Emissions per Capita compared to the Midday period"
{txt}
{com}. label variable regionid1 "Region ID (Encoded)"
{txt}
{com}. label variable dst_transition1 "DST Transition (Encoded)"
{txt}
{com}. label variable dst_direction "Direction of DST for given transition"
{txt}
{com}. label variable wind "Mean Wind Speed (km/h) per day"
{txt}
{com}. label variable wind_3 "Daily mean Wind Speed (km/h) Cubed"
{txt}
{com}. label variable not_midday "Not Midday time period as a 0 or 1"
{txt}
{com}. label variable rooftop_solar_energy_mwh "Rooftop Solar Energy (MWh) per day"
{txt}
{com}. label variable hh_end_fixed "Fixed End Time"
{txt}
{com}. label variable hh_end_local "Local End Time"
{txt}
{com}. label variable hh_start_fixed "Fixed Start Time"
{txt}
{com}. label variable hh_start_local "Local Start Time"
{txt}
{com}. label variable date_fixed "Fixed Date"
{txt}
{com}. label variable midday_control_local "Midday Control (Local Time)"
{txt}
{com}. label variable midday_control_fixed "Midday Control (Fixed Time)"
{txt}
{com}. label variable not_midday_control_local "Not Midday Control (Local Time)"
{txt}
{com}. label variable not_midday_control_fixed "Not Midday Control (Fixed Time)"
{txt}
{com}. label variable hr_local "Local Half-Hour"
{txt}
{com}. label variable hr_fixed "Fixed Half-Hour"
{txt}
{com}. label variable day_of_week_local "Day of Week (Local Time)"
{txt}
{com}. label variable day_of_week_fixed "Day of Week (Fixed Time)"
{txt}
{com}. label variable weekend_local "Weekend (Local)"
{txt}
{com}. label variable weekend_fixed "Weekend (Fixed)"
{txt}
{com}. label variable public_holiday "1 if Public holiday in Region, 0 otherwise"
{txt}
{com}. label variable days_into_dst_extreme_outlier  "Days into DST for Extreme Outliers"
{txt}
{com}. label variable days_into_dst_outlier "Days into DST for Outliers"
{txt}
{com}. label variable population "Population in given State and Time period"
{txt}
{com}. label variable temperature "Mean Daily Temperature °C in given State"
{txt}
{com}. label variable solar_exposure "Solar Exposure Coefficient"
{txt}
{com}. label variable co2_kg_per_capita "KG CO2 Emissions per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita "kwh Electricity Consumption per Capita per 30 Minutes"
{txt}
{com}. label variable energy_kwh_per_capita_midday "Mean Electricity Consumption (kWh) per Capita during the Midday period"
{txt}
{com}. label variable co2_g_per_capita_vs_midday "CO2 Emissions (g) per Capita compared to the Midday period"
{txt}
{com}. label variable date "Date"
{txt}
{com}. label variable dst_date "DST Date"
{txt}
{com}. label variable dst_start "DST Start"
{txt}
{com}. label variable after_transition "After Transition"
{txt}
{com}. label variable dst_transition_id_and_region "DST Transition ID and Region"
{txt}
{com}. label variable energy_wh_per_capita_vs_midday "Electricity Consumption (Wh) per Capita compared to the Midday period"
{txt}
{com}. label variable days_into_dst "Number of Days into the DST transition"
{txt}
{com}. 
. save "data/05-half-hourly.dta", replace
{txt}{p 0 4 2}
file {bf}
data/05-half-hourly.dta{rm}
saved
{p_end}

{com}. 
. 
. // End of file
. 
{txt}end of do-file

{com}. 